app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.includes(:user).order('id DESC').page(params[:page]).per(5)
---
SELECT  `tweets`.* FROM `tweets`  ORDER BY id DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1)

  def create
    Tweet.create(tweet_params)
---
INSERT INTO `tweets` (`name`, `image`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('NYU', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRBW--c5JrpwJKCH-wXRMSgDJyFQVNSmmmUt9ehm_VRNE1uNY2D', 'New York', 1, '2016-11-28 09:44:25', '2016-11-28 09:44:25')

  def destroy
    tweet = Tweet.find(params[:id])
    tweet.destroy if current_user.id == tweet.user_id
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 7 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 7